# Selecting columns

#Database Manipulation

#The only difference of these database languages versus the built-in commands in Python and R is these commands are designed to talk to the databases
#In a real-world project (often dynamic, collaborative, and large-scaled),
#it is unlikely that you will download the data to your local machine every time. 
#Therefore, a database is needed in the infulstructure.


#写result： DataCamp <3 SQL
SELECT 'DataCamp <3 SQL'
AS result;

#SQL, which stands for Structured Query Language--a relational database. have a table 
#each coloum called fields

#从数据库里people里选name
SELECT name FROM people;

#选多个
SELECT name, birthdate
FROM people;

#选全列
SELECT *
FROM people;

#return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:
SELECT *
FROM people
LIMIT 10;

#SELECT DISTINCT
#Often your results will include many duplicate values. 
#If you want to select all the unique values from a column, you can use the DISTINCT keyword.

SELECT DISTINCT language FROM films;

#结果为同种类没有重复的一样一个

#Learning to COUNT
#the number of rows in one or more columns.
SELECT COUNT(*)
FROM people;

#count the number of non-missing values in a particular column
SELECT COUNT(birthdate)
FROM people;
#显示除去birthdate里面的missing value

SELECT COUNT(DISTINCT birthdate)
FROM people;
#显示没有重复没有missing value 的

# Filtering rows

In SQL, the WHERE keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

= equal
<> not equal
< less than
> greater than
<= less than or equal to
>= greater than or equal to

where  +   and

选择films 里面的title 是 'Metropolis'的： 

SELECT title
FROM films
WHERE title = 'Metropolis';

Notice that the WHERE clause always comes after the FROM statement!

选择film里面的title和release year是大于2000的
SELECT title, release_year
FROM films
WHERE release_year > 2000;

选择films 里面年份是1994 到2000年之间的
“and”必须隔行
SELECT title
FROM films
WHERE release_year > 1994
AND release_year < 2000;

Get all details for Spanish language films released after 2000, but before 2010.
SELECT *
FROM films
WHERE release_year > 2000
AND release_year < 2010
AND language = 'Spanish';

where.  +   or

 #either "PG" or "R". and either 1994 or 1995:
SELECT title
FROM films
WHERE (release_year = 1994 OR release_year = 1995)
AND (certification = 'PG' OR certification = 'R');

选择 90s
SELECT title, release_year
FROM films
WHERE release_year >= 1990 AND release_year < 2000;

BETWEEN

It's important to remember that BETWEEN is inclusive, meaning the beginning and end values are included in the results!

SELECT title
FROM films
WHERE release_year
BETWEEN 1994 AND 2000;

SELECT name
FROM kids
WHERE age IN (2, 4, 6, 8, 10);

Introduction to NULL and IS NULL

#to count the number of missing birth dates in the people table:
SELECT COUNT(*)
FROM people
WHERE birthdate IS NULL;

#names of all people whose birth dates are not missing in the people table.
SELECT name
FROM people
WHERE birthdate IS NOT NULL;

LIKE and NOT LIKE

#The % wildcard will match zero, one, or many characters in text.'Data', 'DataC' 'DataCamp', 'DataMind', and so on:
SELECT name
FROM companies
WHERE name LIKE 'Data%';
#搜索所有data加什么什么

#The _ wildcard will match a single character. For example, the following query matches companies like 'DataCamp', 'DataComp', and so on:
SELECT name
FROM companies
WHERE name LIKE 'DataC_mp';

#Get the names of people whose names have 'r' as the second letter. The pattern you need is '_r%'.
select *
from people 
where name LIKE '_r%'

# Aggregate functions

最大值
SELECT MAX(budget)
FROM films;
总和
SELECT SUM(budget)
FROM films;
平均值
SELECT AVG(budget)
FROM films;
最小值
SELECT MIN(budget)
FROM films;

#A note on arithmetic

you can perform basic arithmetic with symbols like +, -, *, and /.
SELECT (4 / 3);

#It's AS simple AS aliasing

得到两个最大值buget and duration
SELECT MAX(budget) AS max_budget,
       MAX(duration) AS max_duration
FROM films;

#Get the title and duration in hours for all films. The duration is in minutes, so you'll need to divide by 60.0 to get the duration in hours. Alias the duration in hours as duration_hours

select title, duration/60.0 AS duration_hours
from films

# ORDER BY

By default ORDER BY will sort in ascending order. If you want to sort the results in descending order, you can use the DESC keyword.

Get the title and gross earnings for movies which begin with the letter 'M' and order the results alphabetically.

select title, gross 
from films 
where title LIKE 'M%'
order by title

Sorting single columns (DESC)

从低到高order by + 要排列的东西+DESC

Sorting multiple columns

SELECT birthdate, name

FROM people

ORDER BY birthdate, name;

# GROUP BY

算男生和女生的数量，ORDER BY 在 GROUP BY之后

SELECT sex, count(*)
FROM employees
GROUP BY sex;

在group后里面用having进行filter
where the HAVING clause comes in. For example,

SELECT release_year
FROM films
GROUP BY release_year
HAVING COUNT(title) > 10;

Get the country, average budget, and average gross take of countries that have made more than 10 films. Order the result by country name, and limit the number of results displayed to 5. You should alias the averages as avg_budget and avg_gross respectively.
选择一个国家超过10部电影包括平均budget平均gross，只展示5个结果。 Heaving 要在group by后面

SELECT country, AVG(budget) AS avg_budget, 
       AVG(gross) AS avg_gross
       
FROM films

GROUP BY country

HAVING COUNT(title) > 10

ORDER BY country

LIMIT 5;

用 JOIN 来连接两个不同的表，用另一个表中的信息（film）加另一个表中的信息（review）

SELECT title, imdb_score
FROM films
JOIN reviews
ON films.id = reviews.film_id
WHERE title = 'To Kill a Mockingbird';